/* Напишите программу, которая на вход принимает число и выдает его квадрат*/
/* тип_данных имя_переменной = значение */

int number = 5; // number=5
int result = number * number; // result = number * number //

Console.WriteLine("Квадрат от числа: " + number + " равен " + result);